//
// testtext.mjs by D.F.Mac.@TripArts Music
// from https://ja.wikipedia.org/wiki/煬帝
//

const texts = {
  cheen:[
    "ち〜ん",
    "ちーーーん",
    "ちん",
    "チーン",
    "ち〜〜ん",
    "cheen",
    "cheeeeeeeeeeeeeeeeeeeeeeeeeeen"
  ],
  etc:[
    "田中ーーーーーーー！！！！！",
    "由美ちゃん？",
    "その響きで心躍る！",
    "新たな世界への扉を開こう！",
    "ドキドキ",
    "缶はないの？",
    "楽しい！",
    "ふーん",
    "おいおい！",
    "草",
    "wwwwwwwww",
    "wwwwwwwwwwwwwwww",
    "www",
    "wwwwwwwwwwwwwwwwwwwwwwwww",
    "wwwwwwwwwwwwwwwwwwwwwwwwwwwww",
    "エモい",
    "ちょっと地味ね",
    "うるさい"
  ],
  longMessage:`
  煬帝（ようだい 北周天和四年（569年） - 隋大業十四年（618年））は、中国隋の第2代皇帝（在位：604年8月21日 - 618年4月11日）。姓は楊、諱は広。煬は唐から贈られた諡であり、「色を好んで礼を無視した、礼に背き人民から嫌われたもの、天に逆らい人民を搾取したもの」という意味がある[1]。

中国史を代表する暴君とされる[2][3]。

煬帝は本来なら漢音で「ようてい」と読むところを呉音で「ようだい」と読むことが慣例となっている[4]。わざわざ「だい」と読むのは暴君であることを強調するためであると思われる[5][6][注釈 1]。

生涯
即位まで
父楊堅・母独孤伽羅夫婦の次男として生まれる。父楊堅は北周十二大将軍の一人楊忠の息子で[8]、母独孤伽羅は八柱国の一人独孤信の七女である[9][10]。 （大将軍・柱国については武川鎮軍閥を参照のこと）。 独孤伽羅は貞節観念・嫉妬心が強く、この時代の貴族としては珍しく一夫一妻を貫き、妾を置かせなかった[8][11]。二人は五男五女を儲け、長女が北周武帝の皇太子宇文贇の妃となった[8][12]。

武帝が崩御して宇文贇（宣帝）が皇帝になるも23歳という若さで崩御して8歳の静帝が後継となる[注釈 2]と外戚として発言力を増した楊堅は581年に静帝から禅譲を受けて隋を建てた（以下、楊堅を文帝と呼び替える。）[15]。なお後に静帝および北周皇族の宇文氏は皆殺しの目にあった[16]。

楊広は隋建国と同時に十三歳にして晋王に封ぜられる[17]。更に588年から始まった陳征伐の総司令官となり、陳を滅ぼした（実際の総指揮は重臣の高熲がとった。）[18][19]。

陳討伐の武勲を挙げた楊広は、兄楊勇から皇太子の座を奪わんと画策した。先述の通り独孤皇后は貞節観念が強く、文帝は奢侈を好まなかった。しかし楊勇は正妻をないがしろにして妾を寵愛したために皇后の不興を買い、文帝の方も皇后の言葉を受けて次第に勇を疎むようになった。対して楊広の方は正妻の蕭氏以外は女性を近づけず、家の調度品も質素なものにしていた。実際にはそれは擬態であって蕭氏以外の女性に出来た子は秘密裏に処理され、文帝たちがやって来たときだけ豪華な調度品を隠していただけであった[20]。

文帝は開皇二十年（600年）に楊勇を廃して庶人に落とし、楊広を皇太子に建てた[21]。２年後の仁寿二年（602年）に独孤皇后が崩御[22]。文帝もまたその2年後の仁寿四年（604年）に崩御し、楊広が帝位を継いだ[23]。

『隋書』「文帝本紀」では、文帝の死は病死であり、死の床で皇太子・大臣たちに別れの言葉を述べて崩御したとある[24]。しかし同じ『隋書』の「后妃伝」では楊広が文帝の寵姫陳氏に関係を迫り、激怒した文帝が楊広を廃嫡しようとした所、楊広側が先んじて文帝を監禁して弑逆されたという話を載せている[25]。弑逆説の方が話としては面白いので、後世の史書及び一般ではこちらが通用している[26]。

帝位に就いた楊広（以下、楊広を煬帝と呼び替える）がまずやったことは楊素の弟楊約に庶人とされていた廃太子楊勇を殺させることであった[23]。更に末弟の漢王楊諒が反乱を起こしたのでこれを制圧して捕らえ、死ぬまで幽閉した[27]。兄弟のうち、三男の秦王楊俊は過度の奢侈により文帝の不興を買って庶人に落とされ、さらに嫉妬した王妃により毒を盛られて病死した[28]。四男蜀王の楊秀もまた煬帝の策略により文帝の不興を買って庶人に落とされて宮中に拘禁されていた[29]。

文帝はかつて「自分の子は全て同母である」と誇っており[30]、この一家が仲良く暮らしていくことを熱望していたが[11]、現実はこのような有様であった。そもそも文帝自身が自らの兄弟と仲違いしていたにもかかわらず、自分の息子達には仲良くしろと口で言ってもそれは無理というものであった[31]。

皇帝として
大運河
煬帝の政策として挙げられる最大のものが何といっても大運河の開削である。

文帝時代の開皇四年（584年）に大興城（長安）と洛陽を結ぶ広通渠を開削[32][33]、さらに開皇七年（587年）に陳征伐のために淮水と長江を繋ぐ邗江（山陽瀆）を開削した[34][35]。煬帝はこれに続けて即位の翌年大業元年（605年）に百余万人を徴して黄河と淮水を繋ぐ通済渠[36][37]、大業四年（608年）には黄河と涿郡（現北京）を繋ぐ永済渠が完成[38]。この工事には女性まで徴発された[38]。そして大業六年（610年）に長江と浙江を繋ぐ江南河が完成し[39][38]、南の江南から北の洛陽・長安を繋ぐ総延長1500kmに及ぶ大運河が完成した[40][38]。

運河の中で流れが無い箇所では人力で引っ張る必要があったので、運河と並行して御道という道路が設けられた[36]。また運河の路線には40余りの離宮が設けられていた[36]。運河の完成を記念して、数千隻の遊覧船と同じく数千隻の護衛艦の大艦隊を洛陽近くの顕仁宮から江都（揚州）まで行進する大デモンストレーションが行われた[41]。

また大運河以外にも文帝により始められた東都洛陽城[42][43][44]、長城[45][46]など大規模な土木工事を多数行った。これらの大工事に使役された人民は強く疲弊し、このことが隋の滅亡に繋がっていくことになる。

外征
北方では突厥が大帝国を築いていたが、文帝が離間策を用いたことで東と西に分裂し、東突厥の啓民可汗は隋に服属した[47][48][49]。大業元年（605）に契丹族が長城を超えて侵入してきた時には煬帝は啓民可汗に命じて兵を出させ、隋軍とともにこれを討った[50]。その二年後の大業三年（607年）に煬帝は北方へと巡幸し、行宮に啓民可汗を招いた[50][51]。しかし煬帝治世末期に隋が混乱すると突厥は長城を越えて隋国内に拠点を持つようになる[52]。

西方では吐谷渾が交易路を妨害していたために煬帝みずから兵を率いてこれを討って現在の青海のあたりまで進んだ[53]。この結果、西域諸国が隋に入朝するようになった[54]。これら　の国からの使者を迎えるに当たり、洛陽に大見本市を開いた。町中に一周するのに8kmもある巨大なサーカスを作って様々な芸を見せ、総勢1万8千人という大楽団に演奏させてその音は2、30kmの先まで聞こえたという。市場の店は全てリニューアルされて珍品奇貨が並び、飲食店では食べ放題飲み放題で料金はいらぬと言われる[55]。これでもかと中国の豊かさを見せつけたのだが、現実の隋は至るところに着る物もない貧乏人がいる状態であって使者たちにもそれは見られていた[56]。

東南ではチャンパ王国（林巴、ベトナム南部）や赤土国[注釈 3]が隋に朝貢し、琉球[注釈 4]には兵を送り込んでその王を斬った[57][54]。

東の倭国（日本）からは数度に渡る遣隋使が送られてきており、「日出づる処の天子、書を日没する処の天子に致す」から始まる国書に煬帝は気分を害して「このような無礼な書を見せるな」と述べた[58]が、答使として裴世清を派遣した[59]。『日本書紀』によると裴世清は「皇帝、倭皇を問う」から始まる国書を返し、日本側はこれを受けて「東天皇敬白西皇帝」から始まる国書を返したという。この記事が正しければ、天皇の「皇」は煬帝が与えたことになるが「天皇」にも気分を害したらしく往来は絶えた（『隋書』倭国伝）。

高句麗戦争
詳細は「隋の高句麗遠征」を参照
以上のように煬帝は積極的な外征を行ったが、外征および大土木事業に酷使された民衆は塗炭の苦しみを味わうこととなり、その恨みが隋滅亡への道筋をつけることになった。そして滅亡の端緒となったのが高句麗遠征である。

当時の朝鮮半島では高句麗・百済・新羅の三国が互いに争っており（三国時代）、国境を接する高句麗に対して開皇十七年（597年）に文帝は遼東王の封号で冊封していた[52]。しかし翌年に高句麗が靺鞨を伴って侵入してきたので文帝は30万という大軍を送り込んだが「死せる者、十に八九」という大敗に終わった[60][52]。

煬帝に代替わりして、上述の煬帝が啓民可汗の元を訪れた際に高句麗からの使者も啓民可汗のところを訪れていた[61][62]。煬帝はこの使者に対して高句麗王に対して服属することを求めたが、高句麗の方ではこれに応じず、守備を固めるようになった[63]。この高句麗の態度に煬帝は高句麗討伐を決意。大業八年（612年）から三度に渡る高句麗遠征を行った（隋の高句麗遠征）。

大業八年（612年）の第一次遠征では総大将を宇文述とし、113万3800の兵力を200万と号して[63][64]（この数字は恐らく誇張[63]）、高句麗に攻め込んで遼河を渡るもその先の遼東城が中々抜けない。一方で水軍が山東から海を渡って高句麗首都平壌に攻めかかるも大敗して兵力の大部分を失った[65][66]。隋軍は攻めあぐねていた遼東城に抑えの兵を置いて進軍し平壌を囲むも抵抗にあって攻撃は頓挫[65]。そうするうちに食糧不足と兵士の疲労が目立つようになり、高句麗からの偽りの降伏の使者を受け入れて引き上げることにした。撤退中に後ろから高句麗軍が攻めかかり、遼河を渡ったときにいた30万5千が還ったのは2700という目を覆わんばかりの惨敗となった[67][68]。

続く大業九年（613年）の第二次遠征においても宇文述が総大将となり、再び遼東城を攻めたが高句麗の抵抗も激しく中々落とすことが出来ない。そうしている間に本国で楊玄感による反乱が起きてしまい、遠征をやめて軍を引き返した[69][70]。

更に翌年大業十年（614年）に第三次遠征軍を送るもこの時点で隋の内乱は激しさを増しており、そのような状況から逃亡兵が相次いだが[71][54]、高句麗側も度重なる戦争で疲弊しており、隋に降伏を申し入れた。ただ降伏と言っても高句麗王が隋に入朝するわけではなく、単に戦闘を止めるというだけである[72]。煬帝も面目を保つためにこの話に乗り、帰還の途に就いた。その最中に一行が盗賊に襲われて馬を盗まれるという事件が起こっている[72][73]。

滅亡
楊玄感は煬帝擁立の功臣楊素の子であったが、宇文述が煬帝の寵臣となったために楊氏一族は冷遇されていた[74]。楊玄感は第二次高句麗遠征において最大の兵站基地黎陽の責任者とされていた。黎陽は江南から運ばれてくる軍事物資を集積し、北の涿郡へと送る重要拠点であった。しかし第一次遠征の際に宇文述は敗戦の責任を兵站になすりつけており、今度の遠征も同じことを言い出して楊玄感が責任を取らされる危険があった[75]。このような状況から楊玄感は隋に対する反乱を起こすこととした。その参謀に就いたのが八柱国李弼のひ孫李密である。楊玄感は李密が下策とした洛陽攻撃を行ったが、上手く行かず。高句麗から還ってきた隋軍により破れて楊玄感は処刑され、李密は逃亡した[76]。

高句麗遠征以前から中小の反乱が起きていたが楊玄感の蜂起を切っ掛けに隋全土に乱が拡大し、「天下の人十分を挙げ、九は盗賊となる」という内乱状態となった[77]。

煬帝は第三次遠征から洛陽に還ったが、宇文述の薦めで騒乱が激しくなった華北を捨てて南の江都（揚州）へと避難した[78]。華北は李密・竇建徳・王世充などが相争う群雄割拠の情勢となり、さらに太原留守であった李淵が首都大興城を陥落させて唐を建てた[79]。

この状態に対して煬帝はもはや北帰は叶わないと諦めて現実から逃避して酒色にふけるようになった[80]。現実から逃避した煬帝だがその一方で皇后に向かって「俺の首を取りに来るのは誰だろうな」とこぼしていた。そして大業十四年（618年）、宇文述の息子宇文化及・宇文智及らが主導するクーデターが起こり、煬帝は毒酒による死を望んだが許されず、縊死した[81]。

死後、煬帝の一族はほとんどが殺されたが煬帝の弟楊俊の末子楊浩が傀儡の皇帝とされるが、後に宇文化及により殺される[82]。洛陽に遺していた孫の楊侗は皇帝とされるも王世充によって殺され、同じく孫の楊侑も李淵によって皇帝に建てられた後に退位させられ最後は長安で死去した。その後の中国は李淵の子李世民（唐太宗）の活躍により数多ある群雄を討滅して中国を統一、300年近くに渡る唐の繁栄の基礎を築いた。

唐が江南を征した後の武徳五年（622年）に煬帝の死体を改葬し、この時に新たに煬の諡が送られた[83]。ちなみに陳の後主が隋に降った後に死去した時に煬帝から贈られた諡もまた煬であった[84]。

評価
煬帝は中国史上を代表する暴君とされる[2][3]。大土木事業・高句麗遠征・過度な奢侈などによって隋を滅亡に追い込んだことは非難されるところである。一方で煬帝に対する再評価も進んでいる。

宮崎市定は煬帝は多々の弱点を抱えた凡庸な人物であり、魏晋南北朝時代のような時代においては凡庸であるほど淫乱暴虐な人物になりやすい。魏晋南北朝時代にはこのような非行天子が大く存在しており、煬帝もまたその一人に過ぎなかった。としている[85]

布目潮渢は煬帝と唐太宗は、次男でありながら長男から太子の座を奪った・高句麗遠征の失敗など共通点が多く、太宗を名君として称えるために煬帝が貶められた可能性を示唆している[86]。

墳墓
2013年3月、中国江蘇省揚州市の工事現場で古代遺跡が発見された。2013年11月16日、この遺跡が煬帝の墓（隋煬帝墓（中国語版））であることが発表された[87]。

詩人としての煬帝
煬帝は統治者としては結果として国を滅ぼした失格者であったが、一面では隋代を代表する文人・詩人でもあった[88]。治世中各地に巡幸した際などしばしば詩作を行なったといわれる。治世後半には自らの没落を予見したのか、寂寥感を湛える抒情詩を数多く残した。
  `
};

class generateText{
  constructor(){
  	this.texts = texts;
  }
  get(){
    console.dir(this.texts);
  	if((Math.random()*10) < 0.3){
      let idx =  Math.floor(Math.random()*this.texts.etc.length);
      return this.texts.etc[idx];
  	}else{
      let idx =  Math.floor(Math.random()*this.texts.cheen.length);
      return this.texts.cheen[idx];
  	}
  }
  getLong(){
    return this.texts.longMessage;
  }
}

export default new generateText();

